---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentCreatingEventArgs.DocumentType
source: html/a7986733-b89f-3cb3-0e60-96c2a1beb1f5.htm
---
# Autodesk.Revit.DB.Events.DocumentCreatingEventArgs.DocumentType Property

Type of the document which is about to be created, e.g. Project or Template.

## Syntax (C#)
```csharp
public DocumentType DocumentType { get; }
```